app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = 1
---
    <tbody>
      <% @project.tasks.each do |task| %>