app/controllers/projects_controller.rb

  def show
    @tasks_by_status = @project.tasks.group(:status).count
---
SELECT COUNT(*) AS "count_all", "tasks"."status" AS "tasks_status" FROM "tasks" WHERE "tasks"."project_id" = 1 GROUP BY "tasks"."status"

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ('Alex is a fagguette', 'Alex should die', '2024-12-19 09:51:03.483604', '2024-12-19 09:51:03.483604') RETURNING "id"

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "description" = 'hello', "updated_at" = '2024-12-19 19:55:39.823174' WHERE "projects"."id" = 12