app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "deadline", "priority", "status", "project_id", "created_at", "updated_at") VALUES ('fsafasgsakngsalkngsa', 'smf a, fgskagsa', '2024-12-19 18:01:00', 11, 'pending', 9, '2024-12-19 18:01:25.387726', '2024-12-19 18:01:25.387726') RETURNING "id"
---
  def create
    @task = @project.tasks.build(task_params)
    if @task.save

UPDATE "tasks" SET "priority" = 33, "status" = 'in progress', "updated_at" = '2024-12-19 10:28:40.325181' WHERE "tasks"."id" = 3
---
  def update
    if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = 9 AND "tasks"."id" = 8 LIMIT 1
---
  def set_task
    @task = @project.tasks.find(params[:id])